docs/how-i-learned-rock-to-fakie.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://mjgpy3.github.io/me/rss.xml"
      title="RSS feed for https://mjgpy3.github.io/me">
<title>How I Learned Rock To Fakie</title>
<meta name="author" content="Michael 'Gilli' Gilliland">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://mjgpy3.github.io/me">Gilli's Land</a>
</div></div>
<div id="content">
<div class="post-date">25 May 2022</div><h1 class="post-title"><a href="https://mjgpy3.github.io/me/how-i-learned-rock-to-fakie.html">How I Learned Rock To Fakie</a></h1>
<p>
I found Rock To Fakie to be an elusive trick. Looking back through my skating log, it took 3 months (to the day) for me to land my first one. If my books are correct, I practiced this trick for 53 sessions before landing! Though I usually wouldn't <i>only</i> practice Rock To Fakie in a session, that's stall a lot of sessions!
</p>

<p>
So, how did I manage to finally land one? Let's get into it.
</p>

<p>
For starters, I watched every trick tip video I could find. The videos that stood out were:
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=vabaAivHplc">Ben Degros' video</a></li>
<li><a href="https://www.youtube.com/watch?v=KTtRbd8FwfM">The Skate Park Lessons' video</a></li>
<li><a href="https://www.youtube.com/watch?v=04FwNWlM6ZM">Sketchy Dave's video</a></li>
<li><a href="https://www.youtube.com/watch?v=pUtYR-K1UP0">Never Stop Improving's video</a></li>
<li><a href="https://www.youtube.com/watch?v=bElNF5oL1XQ">Trog Army's video</a></li>
</ul>

<p>
I dissected these videos among others. I scoured various web forums and even got a few tips from friends. All this was to no avail. Let's walk through some of the tips I encountered and why they didn't work for me.
</p>

<div id="outline-container-orgdae5860" class="outline-2">
<h2 id="orgdae5860">Taps and Lifts</h2>
<div class="outline-text-2" id="text-orgdae5860">
<p>
In trick tip videos, skaters recommend doing little taps. Doing these higher and higher up the ramp while going fakie should lead to Fakie Tail Stall makes. This actually worked out great for me. I got a few little Tail Taps on the coping after a few sessions which evolved into full stalls in short order.
</p>

<p>
Supposedly, doing little tail taps (or lifts) right before going fakie teach you how to lift the board. This lift is the last part of a Rock To Fakie. This didn't work out for me.
</p>

<p>
The forward lifts got comfortable for me. They lead to consistent Uptowns (an underrated trick) and Manual To Fakies. Though comfortable, These lifts didn't seem to help my Rock To Fakies. Whenever I'd try an actual Rock to Fakie something in my weight distribution was way off. I couldn't seem to correct it.
</p>
</div>
</div>

<div id="outline-container-org3a513a8" class="outline-2">
<h2 id="org3a513a8">Eyes and Shoulders</h2>
<div class="outline-text-2" id="text-org3a513a8">
<p>
Some videos claim that the key elements to this trick are:
</p>
<ul class="org-ul">
<li>keeping your shoulders perpendicular to the ramp and</li>
<li>keeping your eyes looking where you want to go.</li>
</ul>

<p>
Keeping your shoulders straight is important but there's some give here. It's clear to me now that shoulder placement wasn't blocking me from learning the trick. Regarding eyes, when I thought about where I was looking I tended to over-think it. This made for some silly (and painful) attempts.
</p>
</div>
</div>

<div id="outline-container-orgf49e809" class="outline-2">
<h2 id="orgf49e809">Confidence 80/20</h2>
<div class="outline-text-2" id="text-orgf49e809">
<p>
Many resources claim that, in actuality, your form only makes up 20% of your ability to execute the trick. The other 80%? Confidence. This may be true for some but it wasn't for me. The "just be confident" advice tends to feel like "just do the thing" advice. Though well-meaning, it is superficially useful. I had a mental block. Hoping for a burst of confidence wasn't cutting through it.
</p>
</div>
</div>

<div id="outline-container-org5fc2f9c" class="outline-2">
<h2 id="org5fc2f9c">Other Little Tricks</h2>
<div class="outline-text-2" id="text-org5fc2f9c">
<p>
I tried many other tricks (in many a combination) including:
</p>
<ul class="org-ul">
<li>being loud &#x2013; both shouting and loudly slamming the rock</li>
<li>doing the trick on the exhale &#x2013; exhales being calming actions</li>
<li>leaning farther back</li>
<li>steeper ramps</li>
<li>more mellow ramps</li>
<li>smaller ramps</li>
<li>long sessions and short sessions</li>
<li>trying the trick alone and in combos</li>
<li>closing my eyes</li>
<li>wearing more pads &#x2013; to try to gain confidence</li>
<li>likely a few other tactics that escape me now</li>
</ul>

<p>
Through all this my right hip screamed for vengeance &#x2013; it took a ton of slams!
</p>
</div>
</div>

<div id="outline-container-orga884fe2" class="outline-2">
<h2 id="orga884fe2">What Worked For Me</h2>
<div class="outline-text-2" id="text-orga884fe2">
<p>
In the midst of battling Rock To Fakies, I learned Rock And Rolls (R&amp;Rs). I got the breakthrough for R&amp;Rs from a Never Stop Improving <a href="https://www.youtube.com/watch?v=WIsJM8v01uI">video</a>. In that video, Justin demonstrates "stabbing" the board forward (a little tap) then kick turning back into the ramp. Doing this gradually up the ramps, you eventually hit the coping. A little later you find you're doing it above the coping and viola! You can Rock And Roll. These little baby R&amp;Rs slowly become real rocks then legendary decked R&amp;Rs as you push your abilities, a bit at a time. This was the same incremental approach that worked for me for finally making Rock To Fakies.
</p>

<p>
The steps in my thought process were: ride up, stab the ramp (do a tap), the pull the board up (as in do a "lift") and ride away. Thinking of the motion as an actual "stabbing" of the board was key, it changed my entire perspective on the trick. I did this stab higher and higher until I started to stab the coping. Then, putting a slight bit more speed behind it, I found I was doing the stab above the coping. A small but sure Rock To Fakie! These Rock To Fakies grew with practice in the exact same way that R&amp;Rs did. Now I can deck them out, land them on bigger ramps and do some odd variants.
</p>
</div>
</div>

<div id="outline-container-org9bfa25d" class="outline-2">
<h2 id="org9bfa25d">Don't Discount The Other Tips</h2>
<div class="outline-text-2" id="text-org9bfa25d">
<p>
I stand by the assertion that the Never Stop Improving video provided the breakthrough for me. Though this is true, I can't discount the other tips mentioned herein. It's hard to say what they contributed to my progress while learning Rock To Fakies &#x2013; They all played a part in the journey. Also, we all know that everyone learns differently. The Never Stop Improving video got <i>me</i> over the hurdle &#x2013; but I'm curious &#x2013; what was your journey to Rock To Fakies like?
</p>
</div>
</div>
<div class="taglist"><a href="https://mjgpy3.github.io/me/tags.html">Tags</a>: <a href="https://mjgpy3.github.io/me/tag-skateboarding.html">skateboarding</a> <a href="https://mjgpy3.github.io/me/tag-trick_tip.html">trick_tip</a> <a href="https://mjgpy3.github.io/me/tag-howto.html">howto</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
